---
kind: property
id: P:Autodesk.Revit.DB.FaceSecondDerivatives.UUDerivative
source: html/b1443e88-a88d-2005-3a54-f5802f942dc5.htm
---
# Autodesk.Revit.DB.FaceSecondDerivatives.UUDerivative Property

The second derivative with respect to U.

## Syntax (C#)
```csharp
public XYZ UUDerivative { get; }
```